In [1]:
import pandas as pd

In [2]:
bios=pd.read_csv('./data/bios.csv')
coffee=pd.read_csv('./warmup-data/coffee.csv')

In [3]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [4]:
bios.tail()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [5]:
bios.info()

<class 'pandas.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  str
 2   born_date     143693 non-null  str
 3   born_city     110908 non-null  str
 4   born_region   110908 non-null  str
 5   born_country  110908 non-null  str
 6   NOC           145499 non-null  str
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   str
dtypes: float64(2), int64(1), str(7)
memory usage: 18.5 MB

In [6]:
bios.loc[bios["height_cm"]>215]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5089,5108,Viktor Pankrashkin,1957-06-19,Moskva (Moscow),Moskva,RUS,Soviet Union,220.0,112.0,1993-07-24
5583,5606,Paulinho Villas Boas,1963-01-26,São Paulo,São Paulo,BRA,Brazil,217.0,106.0,NaN
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN
5716,5739,Uwe Blab,1962-03-26,München (Munich),Bayern,GER,Germany West Germany,218.0,110.0,NaN
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
5796,5819,Andy Campbell,1956-07-21,Melbourne,Victoria,AUS,Australia,218.0,93.0,NaN
6223,6250,Lars Hansen,1954-09-27,København (Copenhagen),Hovedstaden,DEN,Canada,216.0,105.0,NaN
6270,6298,Hu Zhangbao,1963-04-05,NaN,NaN,NaN,People's Republic of China,216.0,135.0,NaN
6409,6440,Sergey Kovalenko,1947-08-11,NaN,NaN,NaN,Soviet Union,216.0,111.0,2004-11-18
6420,6451,Jānis Krūmiņš,1930-01-30,Cēsis,Cēsu novads,LAT,Soviet Union,218.0,141.0,1994-11-20
6504,6537,Luc Longley,1969-01-19,Melbourne,Victoria,AUS,Australia,220.0,135.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN
7074,7111,Paulo da Silva,1963-07-21,São Paulo,São Paulo,BRA,Brazil,217.0,106.0,NaN
7188,7226,Vladimir Tkachenko,1957-09-20,Golovinka,Krasnodar Kray,RUS,Soviet Union,220.0,110.0,NaN
7281,7320,Stojko Vranković,1964-01-22,Drniš,Šibensko-kninska županija,CRO,Croatia Yugoslavia,217.0,115.0,NaN
7376,7416,Eurelijus Žukauskas,1973-08-22,Klaipėda,Klaipėda,LTU,Lithuania,218.0,115.0,NaN
52608,52983,Aleksey Kazakov,1976-03-18,Naberezhnye Chelny,Respublika Tatarstan,RUS,Russian Federation,217.0,102.0,NaN
82100,82753,Frédéric Weis,1977-06-22,Thionville,Moselle,FRA,France,218.0,110.0,NaN
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN
89075,89787,Roberto Dueñas,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN
107408,108533,Peter John Ramos,1985-05-23,Fajardo,Puerto Rico,PUR,Puerto Rico,219.0,113.0,NaN
112312,113568,Stanko Barać,1986-08-13,Mostar,Hercegovačko-neretvanski kanton,BIH,Croatia,217.0,110.0,NaN
112332,113588,Andreas Glyniadakis,1981-08-26,Chania,Kriti,GRE,Greece,216.0,115.0,NaN
112337,113593,Hamed Haddadi,1985-05-19,Ahvaz,Khuzestan,IRI,Islamic Republic of Iran,218.0,110.0,NaN
118663,120400,Timofey Mozgov,1986-07-16,NaN,NaN,NaN,Russian Federation,216.0,113.0,NaN
118676,120415,Dmitry Musersky,1988-10-29,Makiïvka,Donetsk,UKR,Russian Federation,219.0,104.0,NaN
120266,122147,Zhang Zhaoxu,1987-11-18,Binzhou,Shandong,CHN,People's Republic of China,221.0,110.0,NaN
121694,123709,Salah Mejri,1986-06-15,Jendouba,Jendouba,TUN,Tunisia,216.0,110.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN
130460,133147,Li Muhao,1992-06-02,Guiyang,Guizhou,CHN,People's Republic of China,218.0,115.0,NaN
130461,133148,Zhou Qi,1996-01-16,Xinxiang,Henan,CHN,People's Republic of China,217.0,95.0,NaN
138671,142084,Ondřej Balvín,1992-09-20,Ústí nad Labem,Ústecký kraj,CZE,Czechia,216.0,107.0,NaN
139365,142836,Moustapha Fall,1992-02-23,Paris,Paris,FRA,France,218.0,NaN,NaN

In [7]:
bios.loc[(bios["height_cm"]>215)&(bios["born_country"]=='FRA'),['name','height_cm','born_country']]

                  name  height_cm born_country
82100    Frédéric Weis      218.0          FRA
139365  Moustapha Fall      218.0          FRA

In [8]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [9]:
bios.loc[
    (bios['height_cm']>200)&
    (bios['born_country']=='FRA')&
    (bios['born_city']=='Paris'),
    :
].sort_values(['height_cm','weight_kg'],ascending=[0,0])

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
139365,142836,Moustapha Fall,1992-02-23,Paris,Paris,FRA,France,218.0,NaN,NaN
131168,133932,Nicolas Le Goff,1992-02-15,Paris,Paris,FRA,France,206.0,115.0,NaN
122605,124711,Yakhouba Diawara,1982-08-29,Paris,Paris,FRA,France,201.0,102.0,NaN

In [10]:
bios.loc[
    bios['name'].str.contains("Keith")
]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
...,...,...,...,...,...,...,...,...,...,...
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN
117676,119195,Duncan Keith,1983-07-16,Winnipeg,Manitoba,CAN,Canada,185.0,88.0,NaN
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN
127310,129749,Tracy Keith-Matchitt,1990-03-30,Palmerston North,Manawatu-Wanganui,NZL,Cook Islands,167.0,60.0,NaN

In [11]:
bios.loc[
    (bios['born_country'].isin(['USA','FRA','GBR'])&(bios['name'].str.contains('Keith')))
]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
14577,14674,Keith Harrison,1933-03-28,Birmingham,England,GBR,Great Britain,NaN,NaN,NaN
16166,16281,Keith Reynolds,1963-12-25,Solihull,England,GBR,Great Britain,173.0,68.0,NaN
18734,18862,Keith Sinclair,1945-06-26,Sunderland,England,GBR,Great Britain,190.0,79.0,NaN
29897,30123,Keith Langley,1961-06-03,Aldershot,England,GBR,Great Britain,173.0,70.0,NaN
34011,34275,Keith Remfry,1947-11-17,Ealing,England,GBR,Great Britain,193.0,114.0,2015-09-16
46885,47234,Keith Collin,1937-01-18,Marylebone,England,GBR,Great Britain,168.0,63.0,1991-03-06
50929,51288,Keith Carter,1924-08-30,Akron,Ohio,USA,United States,NaN,NaN,2013-05-03
51185,51544,Keith Russell,1948-01-15,Mesa,Arizona,USA,United States,188.0,73.0,NaN
52913,53288,Keith Erickson,1944-04-19,San Francisco,California,USA,United States,196.0,86.0,NaN
55317,55712,Keith Boxell,1958-05-06,Clapham,England,GBR,Great Britain,170.0,87.0,NaN
57818,58226,Keith Peache,1947-08-10,Lewisham,England,GBR,Great Britain,180.0,98.0,NaN
61748,62202,Keith Grogono,1912-11-04,Stratford,England,GBR,Great Britain,NaN,NaN,1999-03-22
62620,63086,Keith Musto,1936-01-12,Rochford,England,GBR,Great Britain,174.0,72.0,NaN
62678,63144,Keith Notary,1960-01-22,Merritt Island,Florida,USA,United States,170.0,66.0,NaN
68324,68841,Keith Angus,1943-04-05,Sheffield,England,GBR,Great Britain,170.0,59.0,NaN
68472,68989,Keith Cullen,1972-06-13,Ilford,England,GBR,Great Britain,177.0,61.0,NaN
68997,69514,Keith Stock,1957-03-18,Woolwich,England,GBR,Great Britain,176.0,73.0,NaN
77550,78141,Keith Brantly,1962-05-23,Scott Air Force Base,Illinois,USA,United States,180.0,64.0,NaN
84097,84766,Keith Christiansen,1944-07-14,International Falls,Minnesota,USA,United States,165.0,69.0,2018-11-05
94646,95413,Keith Meyer,1938-06-20,Geneva,Illinois,USA,United States,NaN,NaN,2010-07-25
95267,96037,Keith Oliver,1947-10-27,Liverpool,England,GBR,Great Britain,172.0,68.0,NaN
96452,97229,Keith Schellenberg,1929-03-13,Middlesbrough,England,GBR,Great Britain,NaN,NaN,2019-10-28
97499,98286,Keith Tkachuk,1972-03-28,Melrose,Massachusetts,USA,United States,188.0,102.0,NaN
98068,98860,Keith Wegeman,1929-08-28,Denver,Colorado,USA,United States,NaN,NaN,1974-08-22
99921,100722,Keith Carney,1970-02-03,Providence,Rhode Island,USA,United States,188.0,93.0,NaN
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN

In [12]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [13]:
coffee['Price']=4.99

In [14]:
coffee.head()

         Day Coffee Type  Units Sold  Price
0     Monday    Espresso          25   4.99
1     Monday       Latte          15   4.99
2    Tuesday    Espresso          30   4.99
3    Tuesday       Latte          20   4.99
4  Wednesday    Espresso          35   4.99

In [15]:
import numpy as np 
coffee_new=coffee.copy()
coffee_new['New_Price']=np.where(coffee['Coffee Type']=='Espresso',150,100)

In [16]:
coffee_new.head()

         Day Coffee Type  Units Sold  Price  New_Price
0     Monday    Espresso          25   4.99        150
1     Monday       Latte          15   4.99        100
2    Tuesday    Espresso          30   4.99        150
3    Tuesday       Latte          20   4.99        100
4  Wednesday    Espresso          35   4.99        150

In [17]:
coffee_new.drop(2,inplace=True)

In [18]:
coffee_new.drop(columns=['Price'])

          Day Coffee Type  Units Sold  New_Price
0      Monday    Espresso          25        150
1      Monday       Latte          15        100
3     Tuesday       Latte          20        100
4   Wednesday    Espresso          35        150
5   Wednesday       Latte          25        100
6    Thursday    Espresso          40        150
7    Thursday       Latte          30        100
8      Friday    Espresso          45        150
9      Friday       Latte          35        100
10   Saturday    Espresso          45        150
11   Saturday       Latte          35        100
12     Sunday    Espresso          45        150
13     Sunday       Latte          35        100

In [19]:
coffee_new.drop(columns=['Price'], inplace=True)

In [20]:
coffee_new

          Day Coffee Type  Units Sold  New_Price
0      Monday    Espresso          25        150
1      Monday       Latte          15        100
3     Tuesday       Latte          20        100
4   Wednesday    Espresso          35        150
5   Wednesday       Latte          25        100
6    Thursday    Espresso          40        150
7    Thursday       Latte          30        100
8      Friday    Espresso          45        150
9      Friday       Latte          35        100
10   Saturday    Espresso          45        150
11   Saturday       Latte          35        100
12     Sunday    Espresso          45        150
13     Sunday       Latte          35        100

In [21]:
coffee_new.loc[2]=['Tuesday','Espresso','30','150']

In [22]:
coffee_new

          Day Coffee Type Units Sold New_Price
0      Monday    Espresso         25       150
1      Monday       Latte         15       100
3     Tuesday       Latte         20       100
4   Wednesday    Espresso         35       150
5   Wednesday       Latte         25       100
6    Thursday    Espresso         40       150
7    Thursday       Latte         30       100
8      Friday    Espresso         45       150
9      Friday       Latte         35       100
10   Saturday    Espresso         45       150
11   Saturday       Latte         35       100
12     Sunday    Espresso         45       150
13     Sunday       Latte         35       100
2     Tuesday    Espresso         30       150

In [23]:
coffee_new=coffee_new.sort_index()

In [24]:
coffee_new.head()

         Day Coffee Type Units Sold New_Price
0     Monday    Espresso         25       150
1     Monday       Latte         15       100
2    Tuesday    Espresso         30       150
3    Tuesday       Latte         20       100
4  Wednesday    Espresso         35       150

In [25]:
coffee

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso          25   4.99
1      Monday       Latte          15   4.99
2     Tuesday    Espresso          30   4.99
3     Tuesday       Latte          20   4.99
4   Wednesday    Espresso          35   4.99
5   Wednesday       Latte          25   4.99
6    Thursday    Espresso          40   4.99
7    Thursday       Latte          30   4.99
8      Friday    Espresso          45   4.99
9      Friday       Latte          35   4.99
10   Saturday    Espresso          45   4.99
11   Saturday       Latte          35   4.99
12     Sunday    Espresso          45   4.99
13     Sunday       Latte          35   4.99

In [26]:
coffee_new

          Day Coffee Type Units Sold New_Price
0      Monday    Espresso         25       150
1      Monday       Latte         15       100
2     Tuesday    Espresso         30       150
3     Tuesday       Latte         20       100
4   Wednesday    Espresso         35       150
5   Wednesday       Latte         25       100
6    Thursday    Espresso         40       150
7    Thursday       Latte         30       100
8      Friday    Espresso         45       150
9      Friday       Latte         35       100
10   Saturday    Espresso         45       150
11   Saturday       Latte         35       100
12     Sunday    Espresso         45       150
13     Sunday       Latte         35       100

In [27]:
coffee_new['Units Sold'] = pd.to_numeric(coffee_new['Units Sold'])
coffee_new['New_Price'] = pd.to_numeric(coffee_new['New_Price'])

In [28]:
coffee_new.info()

<class 'pandas.DataFrame'>
Index: 14 entries, 0 to 13
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     str
 1   Coffee Type  14 non-null     str
 2   Units Sold   14 non-null     int64
 3   New_Price    14 non-null     int64
dtypes: int64(2), str(2)
memory usage: 755.0 bytes

In [29]:
coffee_new['Revenue']=coffee_new['Units Sold'] * coffee_new['New_Price']

In [30]:
coffee_new.head()

         Day Coffee Type  Units Sold  New_Price  Revenue
0     Monday    Espresso          25        150     3750
1     Monday       Latte          15        100     1500
2    Tuesday    Espresso          30        150     4500
3    Tuesday       Latte          20        100     2000
4  Wednesday    Espresso          35        150     5250

In [31]:
coffee_new['Revenue'].head(5).sum()

np.int64(17000)

In [32]:
coffee_new.rename(columns={'New_Price':'Price'}, inplace=True)

In [33]:
coffee_new.head()

         Day Coffee Type  Units Sold  Price  Revenue
0     Monday    Espresso          25    150     3750
1     Monday       Latte          15    100     1500
2    Tuesday    Espresso          30    150     4500
3    Tuesday       Latte          20    100     2000
4  Wednesday    Espresso          35    150     5250

In [34]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [35]:
bios_new=bios.copy()

In [36]:
bios_new['first_name']=bios_new['name'].str.split(' ').str[0]

In [37]:
bios_new.loc[bios_new['first_name']=='Keith']

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN,Keith
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31,Keith
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN,Keith
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09,Keith
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22,Keith
...,...,...,...,...,...,...,...,...,...,...,...
99921,100722,Keith Carney,1970-02-03,Providence,Rhode Island,USA,United States,188.0,93.0,NaN,Keith
102227,103168,Keith Beavers,1983-02-09,London,Ontario,CAN,Canada,185.0,75.0,NaN,Keith
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15,Keith
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN,Keith
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN,Keith

In [38]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert

In [39]:
bios_new['born_datetime']=pd.to_datetime(bios_new['born_date']).dt.year.astype('Int64')

In [40]:
bios_new[['name','born_datetime']]

                         name  born_datetime
0       Jean-François Blanchy           1886
1              Arnaud Boetsch           1969
2                Jean Borotra           1898
3             Jacques Brugnon           1895
4                Albert Canet           1878
...                       ...            ...
145495      Polina Luchnikova           2002
145496    Valeriya Merkusheva           1999
145497        Yuliya Smirnova           1998
145498         André Foussard           1899
145499          Bill Phillips           1913

[145500 rows x 2 columns]

In [41]:
bios_new.to_csv('./data/bios_new.csv', index=False)

In [42]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [43]:
bios_new['height_category']=(bios_new['height_cm'].apply(lambda x : 'short' if x<165 else('average' if x < 185 else 'Tall')))

In [44]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [45]:
def categorize_athlete(row):
    if row['height_cm']<175 and row['weight_kg']<70:
        return 'lightweight'
    elif row['height_cm']<185 and row['weight_kg']<=85:
        return 'Midweight'
    else:
        return 'Heavyweight'

bios_new['Cateogry']=bios_new.apply(categorize_athlete, axis=1)

In [46]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime,height_category,Cateogry
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886,Tall,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969,average,Midweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898,average,Midweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895,average,lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878,Tall,Heavyweight

In [47]:
nocs=pd.read_csv('./data/noc_regions.csv')

In [48]:
nocs.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [49]:
bios_new=pd.merge(bios, nocs, left_on='born_country', right_on='NOC',how='left')

In [50]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,NOC_y,region,notes
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,GBR,UK,NaN

In [51]:
bios_new.loc[(bios_new['NOC_x'])!=(bios_new['region'])]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,NOC_y,region,notes
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,GBR,UK,NaN
12,13,J. Defert,NaN,NaN,NaN,NaN,France,NaN,NaN,NaN,NaN,NaN,NaN
13,14,Étienne Durand,NaN,NaN,NaN,NaN,France,NaN,NaN,NaN,NaN,NaN,NaN
16,17,Guy Forget,1965-01-04,Casablanca,Casablanca-Settat,MAR,France,189.0,79.0,NaN,MAR,Morocco,NaN
27,28,"Guy, Baron Lejeune",NaN,NaN,NaN,NaN,France,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
145491,149218,Matthew Wepke,1989-12-05,NaN,NaN,NaN,Jamaica,NaN,NaN,NaN,NaN,NaN,NaN
145493,149220,Landysh Falyakhova,1998-08-31,Dva Polya Artash,Respublika Tatarstan,RUS,ROC,NaN,NaN,NaN,RUS,Russia,NaN
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,RUS,Russia,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,RUS,Russia,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,RUS,Russia,NaN

In [52]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [53]:
usa=bios[bios['born_country']=='USA'].copy()
gbr=bios[bios['born_country']=='GBR'].copy()

In [54]:
new_df=pd.concat([usa,gbr])

In [55]:
new_df.tail()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
144811,148512,Benjamin Alexander,1983-05-08,London,England,GBR,Jamaica,NaN,NaN,NaN
144815,148517,Ashley Watson,1993-10-28,Peterborough,England,GBR,Jamaica,NaN,NaN,NaN
145005,148716,Peder Kongshaug,2001-08-13,Wimbledon,England,GBR,Norway,184.0,86.0,NaN
145319,149041,Axel Brown,1992-04-02,Harrogate,England,GBR,Trinidad and Tobago,NaN,NaN,NaN
145388,149111,Jean-Luc Baker,1993-10-07,Burnley,England,GBR,United States,NaN,NaN,NaN

In [56]:
coffee.head()

         Day Coffee Type  Units Sold  Price
0     Monday    Espresso          25   4.99
1     Monday       Latte          15   4.99
2    Tuesday    Espresso          30   4.99
3    Tuesday       Latte          20   4.99
4  Wednesday    Espresso          35   4.99

In [57]:
coffee['Units Sold'] = coffee['Units Sold'].astype(float)
coffee.loc[[0,1], 'Units Sold'] = np.nan

In [58]:
coffee

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso         NaN   4.99
1      Monday       Latte         NaN   4.99
2     Tuesday    Espresso        30.0   4.99
3     Tuesday       Latte        20.0   4.99
4   Wednesday    Espresso        35.0   4.99
5   Wednesday       Latte        25.0   4.99
6    Thursday    Espresso        40.0   4.99
7    Thursday       Latte        30.0   4.99
8      Friday    Espresso        45.0   4.99
9      Friday       Latte        35.0   4.99
10   Saturday    Espresso        45.0   4.99
11   Saturday       Latte        35.0   4.99
12     Sunday    Espresso        45.0   4.99
13     Sunday       Latte        35.0   4.99

In [59]:
coffee.isna().sum()

Day            0
Coffee Type    0
Units Sold     2
Price          0
dtype: int64

In [60]:
coffee=coffee.fillna(coffee['Units Sold'].mean())

In [61]:
coffee

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso        35.0   4.99
1      Monday       Latte        35.0   4.99
2     Tuesday    Espresso        30.0   4.99
3     Tuesday       Latte        20.0   4.99
4   Wednesday    Espresso        35.0   4.99
5   Wednesday       Latte        25.0   4.99
6    Thursday    Espresso        40.0   4.99
7    Thursday       Latte        30.0   4.99
8      Friday    Espresso        45.0   4.99
9      Friday       Latte        35.0   4.99
10   Saturday    Espresso        45.0   4.99
11   Saturday       Latte        35.0   4.99
12     Sunday    Espresso        45.0   4.99
13     Sunday       Latte        35.0   4.99

In [62]:
coffee_new.head()

         Day Coffee Type  Units Sold  Price  Revenue
0     Monday    Espresso          25    150     3750
1     Monday       Latte          15    100     1500
2    Tuesday    Espresso          30    150     4500
3    Tuesday       Latte          20    100     2000
4  Wednesday    Espresso          35    150     5250

In [63]:
coffee_new['Units Sold']=coffee_new['Units Sold'].astype(float)

In [64]:
coffee_new.loc[3:6,'Units Sold']=np.nan

In [65]:
coffee_new.head()

         Day Coffee Type  Units Sold  Price  Revenue
0     Monday    Espresso        25.0    150     3750
1     Monday       Latte        15.0    100     1500
2    Tuesday    Espresso        30.0    150     4500
3    Tuesday       Latte         NaN    100     2000
4  Wednesday    Espresso         NaN    150     5250

In [66]:
coffee_new['Units Sold']=coffee_new['Units Sold'].interpolate()

In [67]:
coffee_new

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso        25.0    150     3750
1      Monday       Latte        15.0    100     1500
2     Tuesday    Espresso        30.0    150     4500
3     Tuesday       Latte        30.0    100     2000
4   Wednesday    Espresso        30.0    150     5250
5   Wednesday       Latte        30.0    100     2500
6    Thursday    Espresso        30.0    150     6000
7    Thursday       Latte        30.0    100     3000
8      Friday    Espresso        45.0    150     6750
9      Friday       Latte        35.0    100     3500
10   Saturday    Espresso        45.0    150     6750
11   Saturday       Latte        35.0    100     3500
12     Sunday    Espresso        45.0    150     6750
13     Sunday       Latte        35.0    100     3500

In [68]:
coffee_new.loc[[3,4],'Units Sold']=np.nan

In [69]:
coffee_new=coffee_new.dropna()

In [70]:
coffee_new

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso        25.0    150     3750
1      Monday       Latte        15.0    100     1500
2     Tuesday    Espresso        30.0    150     4500
5   Wednesday       Latte        30.0    100     2500
6    Thursday    Espresso        30.0    150     6000
7    Thursday       Latte        30.0    100     3000
8      Friday    Espresso        45.0    150     6750
9      Friday       Latte        35.0    100     3500
10   Saturday    Espresso        45.0    150     6750
11   Saturday       Latte        35.0    100     3500
12     Sunday    Espresso        45.0    150     6750
13     Sunday       Latte        35.0    100     3500

In [71]:
coffee_new[coffee_new['Units Sold'].isna()]

Empty DataFrame
Columns: [Day, Coffee Type, Units Sold, Price, Revenue]
Index: []

In [72]:
coffee_new[coffee_new['Units Sold'].notna()]

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso        25.0    150     3750
1      Monday       Latte        15.0    100     1500
2     Tuesday    Espresso        30.0    150     4500
5   Wednesday       Latte        30.0    100     2500
6    Thursday    Espresso        30.0    150     6000
7    Thursday       Latte        30.0    100     3000
8      Friday    Espresso        45.0    150     6750
9      Friday       Latte        35.0    100     3500
10   Saturday    Espresso        45.0    150     6750
11   Saturday       Latte        35.0    100     3500
12     Sunday    Espresso        45.0    150     6750
13     Sunday       Latte        35.0    100     3500

In [73]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [74]:
bios['born_city'].value_counts()

born_city
Budapest            1378
Moskva (Moscow)      883
Oslo                 708
Stockholm            629
Praha (Prague)       600
                    ...
Tsivilsk               1
Roth                   1
Romoos                 1
Dva Polya Artash       1
Dulwich Hill           1
Name: count, Length: 22368, dtype: int64

In [75]:
bios[bios['born_country']=='USA']['born_region'].value_counts()

born_region
California              1634
New York                 990
Illinois                 585
Pennsylvania             530
Massachusetts            530
New Jersey               381
Texas                    368
Minnesota                365
Ohio                     328
Michigan                 319
Washington               240
Florida                  235
Wisconsin                209
Colorado                 207
Connecticut              156
Indiana                  150
Oregon                   132
Georgia                  129
Virginia                 121
Maryland                 117
District of Columbia     107
Iowa                     102
Hawaiʻi                   95
Kansas                    94
Oklahoma                  93
Louisiana                 92
Utah                      91
Missouri                  91
North Carolina            86
Arizona                   83
New Hampshire             83
Vermont                   68
Mississippi               66
Alabama                   64
Tennessee                 62
Kentucky                  62
Nebraska                  60
Rhode Island              56
Montana                   55
Maine                     50
South Carolina            50
Alaska                    45
Arkansas                  42
Idaho                     41
New Mexico                38
Nevada                    36
South Dakota              27
West Virginia             24
Delaware                  22
North Dakota              16
Wyoming                   14
Name: count, dtype: int64

In [76]:
coffee

          Day Coffee Type  Units Sold  Price
0      Monday    Espresso        35.0   4.99
1      Monday       Latte        35.0   4.99
2     Tuesday    Espresso        30.0   4.99
3     Tuesday       Latte        20.0   4.99
4   Wednesday    Espresso        35.0   4.99
5   Wednesday       Latte        25.0   4.99
6    Thursday    Espresso        40.0   4.99
7    Thursday       Latte        30.0   4.99
8      Friday    Espresso        45.0   4.99
9      Friday       Latte        35.0   4.99
10   Saturday    Espresso        45.0   4.99
11   Saturday       Latte        35.0   4.99
12     Sunday    Espresso        45.0   4.99
13     Sunday       Latte        35.0   4.99

In [77]:
coffee.groupby(['Coffee Type', 'Day'])['Units Sold'].mean()

Coffee Type  Day
Espresso     Friday       45.0
             Monday       35.0
             Saturday     45.0
             Sunday       45.0
             Thursday     40.0
             Tuesday      30.0
             Wednesday    35.0
Latte        Friday       35.0
             Monday       35.0
             Saturday     35.0
             Sunday       35.0
             Thursday     30.0
             Tuesday      20.0
             Wednesday    25.0
Name: Units Sold, dtype: float64

In [78]:
coffee.groupby(['Coffee Type','Day']).agg({'Units Sold':'sum', 'Price':'mean'})

                       Units Sold  Price
Coffee Type Day
Espresso    Friday           45.0   4.99
            Monday           35.0   4.99
            Saturday         45.0   4.99
            Sunday           45.0   4.99
            Thursday         40.0   4.99
            Tuesday          30.0   4.99
            Wednesday        35.0   4.99
Latte       Friday           35.0   4.99
            Monday           35.0   4.99
            Saturday         35.0   4.99
            Sunday           35.0   4.99
            Thursday         30.0   4.99
            Tuesday          20.0   4.99
            Wednesday        25.0   4.99

In [79]:
coffee_new

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso        25.0    150     3750
1      Monday       Latte        15.0    100     1500
2     Tuesday    Espresso        30.0    150     4500
5   Wednesday       Latte        30.0    100     2500
6    Thursday    Espresso        30.0    150     6000
7    Thursday       Latte        30.0    100     3000
8      Friday    Espresso        45.0    150     6750
9      Friday       Latte        35.0    100     3500
10   Saturday    Espresso        45.0    150     6750
11   Saturday       Latte        35.0    100     3500
12     Sunday    Espresso        45.0    150     6750
13     Sunday       Latte        35.0    100     3500

In [80]:
pivot=coffee_new.pivot(columns='Coffee Type', index='Day', values='Revenue')

In [81]:
pivot

Coffee Type  Espresso   Latte
Day
Friday         6750.0  3500.0
Monday         3750.0  1500.0
Saturday       6750.0  3500.0
Sunday         6750.0  3500.0
Thursday       6000.0  3000.0
Tuesday        4500.0     NaN
Wednesday         NaN  2500.0

In [82]:
pivot.loc['Monday','Latte']

np.float64(1500.0)

In [83]:
pivot.sum()

Coffee Type
Espresso    34500.0
Latte       17500.0
dtype: float64

In [84]:
pivot.sum(axis=1)

Day
Friday       10250.0
Monday        5250.0
Saturday     10250.0
Sunday       10250.0
Thursday      9000.0
Tuesday       4500.0
Wednesday     2500.0
dtype: float64

In [86]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [88]:
bios['born_date']=pd.to_datetime(bios['born_date'])
bios['born_year']=bios['born_date'].dt.year
bios['month_born']=bios['born_date'].dt.month
bios.groupby([bios['born_year'],bios['month_born']])['name'].count().reset_index().sort_values('name',ascending=0)

      born_year  month_born  name
1437     1970.0         1.0   239
1461     1972.0         1.0   229
1629     1986.0         1.0   227
1497     1975.0         1.0   227
1617     1985.0         1.0   225
...         ...         ...   ...
95       1857.0         5.0     1
96       1857.0         7.0     1
97       1857.0         8.0     1
98       1857.0         9.0     1
1884     2009.0         1.0     1

[1885 rows x 3 columns]